In [7]:
import pandas as pd
# DataFrame de estudiantes
estudiantes = pd.DataFrame({
    "id_estudiante": [1, 2, 3, 4],
    "nombre": ["Ana", "Luis", "María", "Carlos"]
})

# DataFrame de calificaciones
calificaciones = pd.DataFrame({
    "id_estudiante": [1, 2, 5],
    "calificacion": [90, 85, 88]
})


print(estudiantes)

   id_estudiante  nombre
0              1     Ana
1              2    Luis
2              3   María
3              4  Carlos

In [6]:
print(calificaciones)

   id_estudiante  calificacion
0              1            90
1              2            85
2              5            88

In [8]:
inner_merge = pd.merge(estudiantes, calificaciones, on="id_estudiante", how="inner")
inner_merge

   id_estudiante nombre  calificacion
0              1    Ana            90
1              2   Luis            85

In [9]:
left_merge = pd.merge(estudiantes, calificaciones, on="id_estudiante", how="left")
left_merge

   id_estudiante  nombre  calificacion
0              1     Ana          90.0
1              2    Luis          85.0
2              3   María           NaN
3              4  Carlos           NaN

In [10]:
# RIGHT JOIN: todas las calificaciones aunque no exista el estudiante
right_merge = pd.merge(estudiantes, calificaciones, on="id_estudiante", how="right")
right_merge

   id_estudiante nombre  calificacion
0              1    Ana            90
1              2   Luis            85
2              5    NaN            88

In [11]:
# OUTER JOIN: unión completa
outer_merge = pd.merge(estudiantes, calificaciones, on="id_estudiante", how="outer")
outer_merge

   id_estudiante  nombre  calificacion
0              1     Ana          90.0
1              2    Luis          85.0
2              3   María           NaN
3              4  Carlos           NaN
4              5     NaN          88.0

In [12]:
ventas_enero = pd.DataFrame({
    "producto": ["Laptop", "Mouse"],
    "ventas": [10, 50]
})

ventas_febrero = pd.DataFrame({
    "producto": ["Laptop", "Teclado"],
    "ventas": [8, 30]
})

In [13]:
ventas_enero

  producto  ventas
0   Laptop      10
1    Mouse      50

In [15]:
ventas_febrero

  producto  ventas
0   Laptop       8
1  Teclado      30

In [21]:
ventas_total = pd.concat([ventas_enero, ventas_febrero], axis=0)
ventas_total

  producto  ventas
0   Laptop      10
1    Mouse      50
0   Laptop       8
1  Teclado      30

In [22]:
datos_producto = pd.DataFrame({
    "producto": ["Laptop", "Mouse", "Teclado"]
})

datos_precio = pd.DataFrame({
    "precio": [20000, 300, 500]
})

In [23]:
datos_producto

  producto
0   Laptop
1    Mouse
2  Teclado

In [24]:
datos_precio

   precio
0   20000
1     300
2     500

In [27]:
productos_completos = pd.concat([datos_producto, datos_precio], axis=1)
productos_completos

  producto  precio
0   Laptop   20000
1    Mouse     300
2  Teclado     500

In [28]:
clientes = pd.DataFrame({
    "nombre": ["Juan", "Laura", "Pedro"]
}, index=[1, 2, 3])

compras = pd.DataFrame({
    "total_compras": [500, 700]
}, index=[1, 3])

clientes.join(compras)

  nombre  total_compras
1   Juan          500.0
2  Laura            NaN
3  Pedro          700.0

In [29]:
empleados = pd.DataFrame({
    "id_empleado": [1, 2, 3],
    "nombre": ["Sofía", "Miguel", "Andrea"]
})

departamentos = pd.DataFrame({
    "id_empleado": [1, 3],
    "departamento": ["IT", "Recursos Humanos"]
})

In [30]:
empleados

   id_empleado  nombre
0            1   Sofía
1            2  Miguel
2            3  Andrea

In [31]:
departamentos

   id_empleado      departamento
0            1                IT
1            3  Recursos Humanos

In [32]:
# Convertir columna a índice y hacer join
empleados.set_index("id_empleado").join(
    departamentos.set_index("id_empleado")
)

             nombre      departamento
id_empleado
1             Sofía                IT
2            Miguel               NaN
3            Andrea  Recursos Humanos